[
  "Yo mama's so fat, when she fell I didn't laugh, but the sidewalk cracked up.",
  "Yo mama's so fat, when she skips a meal, the stock market drops.",
  "Yo mama's so fat, it took me two buses and a train to get to her good side.",
  "Yo mama's so fat, when she goes camping, the bears hide their food.",
  "Yo mama's so fat, if she buys a fur coat, a whole species will become extinct.",
  "Yo mama's so fat, she stepped on a scale and it said: 'To be continued.'",
  "Yo mama's so fat, I swerved to miss her in my car and ran out of gas.",
  "Yo mama's so fat, when she wears high heels, she strikes oil.",
  "Yo mama's so fat, when she sits around the house, she SITS AROUND the house.",
  "Yo mama's so fat, her car has stretch marks.",
  "Yo mama's so fat, she can't even jump to a conclusion.",
  "Yo mama's so fat, her blood type is Ragu.",
  "Yo mama's so fat, if she was a Star Wars character, her name would be Admiral Snackbar.",
  "Yo mama's so fat, she brought a spoon to the Super Bowl.",
  "Yo mama's so stupid, she stared at a cup of orange juice for 12 hours because it said 'concentrate.'",
  "Yo mama's so stupid when they said it was chilly outside, she grabbed a bowl.",
  "Yo mama's so stupid, she put lipstick on her forehead to make up her mind.",
  "Yo mama's so stupid, when they said, 'Order in the court,' she asked for fries and a shake.",
  "Yo mama's so stupid, she thought a quarterback was a refund.",
  "Yo mama's so stupid, she thought a quarterback was a refund.",
  "Yo mama's so stupid, she got hit by a parked car.",
  "Yo mama's so stupid, when I told her that she lost her mind, she went looking for it",
  "Yo mama's so stupid, she went to the dentist to get a Bluetooth.",
  "Yo mama's so stupid, she took a ruler to bed to see how long she slept.",
  "Yo mama's so stupid, she got locked in the grocery store and starved to death.",
  "Yo mama's so stupid, when I said, 'Drinks on the house,' she got a ladder.",
  "Yo mama's so stupid, it takes her two hours to watch 60 Minutes.",
  "Yo mama's so stupid, she put airbags on her computer in case it crashed."
]